In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.240162  0.395355 -1.078836  0.700353
2013-01-02 -0.946592  0.253038 -0.904587 -0.314626
2013-01-03  1.366195  0.643440  0.533915  0.060252
2013-01-04 -0.694961 -0.292589 -1.421548 -1.546865
2013-01-05  0.328955 -0.243784  0.134445 -0.564902
2013-01-06  1.329348  1.625373 -0.636392  0.846540

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.240162  0.395355 -1.078836  0.700353
2013-01-02 -0.946592  0.253038 -0.904587 -0.314626
2013-01-03  1.366195  0.643440  0.533915  0.060252
2013-01-04 -0.694961 -0.292589 -1.421548 -1.546865
2013-01-05  0.328955 -0.243784  0.134445 -0.564902

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.694961 -0.292589 -1.421548 -1.546865
2013-01-05  0.328955 -0.243784  0.134445 -0.564902
2013-01-06  1.329348  1.625373 -0.636392  0.846540

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.270518  0.396805 -0.562167 -0.136541
std    0.973598  0.703775  0.750321  0.884284
min   -0.946592 -0.292589 -1.421548 -1.546865
25%   -0.461180 -0.119579 -1.035273 -0.502333
50%    0.284559  0.324196 -0.770489 -0.127187
75%    1.079250  0.581419 -0.058264  0.540328
max    1.366195  1.625373  0.533915  0.846540

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.240162   -0.946592    1.366195   -0.694961    0.328955    1.329348
B    0.395355    0.253038    0.643440   -0.292589   -0.243784    1.625373
C   -1.078836   -0.904587    0.533915   -1.421548    0.134445   -0.636392
D    0.700353   -0.314626    0.060252   -1.546865   -0.564902    0.846540

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.700353 -1.078836  0.395355  0.240162
2013-01-02 -0.314626 -0.904587  0.253038 -0.946592
2013-01-03  0.060252  0.533915  0.643440  1.366195
2013-01-04 -1.546865 -1.421548 -0.292589 -0.694961
2013-01-05 -0.564902  0.134445 -0.243784  0.328955
2013-01-06  0.846540 -0.636392  1.625373  1.329348

In [16]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.694961 -0.292589 -1.421548 -1.546865
2013-01-05  0.328955 -0.243784  0.134445 -0.564902
2013-01-02 -0.946592  0.253038 -0.904587 -0.314626
2013-01-01  0.240162  0.395355 -1.078836  0.700353
2013-01-03  1.366195  0.643440  0.533915  0.060252
2013-01-06  1.329348  1.625373 -0.636392  0.846540

In [17]:
df["A"]

2013-01-01    0.240162
2013-01-02   -0.946592
2013-01-03    1.366195
2013-01-04   -0.694961
2013-01-05    0.328955
2013-01-06    1.329348
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  0.240162  0.395355 -1.078836  0.700353
2013-01-02 -0.946592  0.253038 -0.904587 -0.314626
2013-01-03  1.366195  0.643440  0.533915  0.060252

In [19]:
df.loc[dates[0]]

A    0.240162
B    0.395355
C   -1.078836
D    0.700353
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.240162  0.395355
2013-01-02 -0.946592  0.253038
2013-01-03  1.366195  0.643440
2013-01-04 -0.694961 -0.292589
2013-01-05  0.328955 -0.243784
2013-01-06  1.329348  1.625373

In [21]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.946592  0.253038
2013-01-03  1.366195  0.643440
2013-01-04 -0.694961 -0.292589

In [22]:
df.loc[dates[0], "A"]

0.24016201833405415

In [23]:
df.at[dates[0], "A"]

0.24016201833405415

In [24]:
df.iloc[3]

A   -0.694961
B   -0.292589
C   -1.421548
D   -1.546865
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.694961 -0.292589
2013-01-05  0.328955 -0.243784

In [26]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.946592 -0.904587
2013-01-03  1.366195  0.533915
2013-01-05  0.328955  0.134445

In [27]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.946592  0.253038 -0.904587 -0.314626
2013-01-03  1.366195  0.643440  0.533915  0.060252

In [28]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.395355 -1.078836
2013-01-02  0.253038 -0.904587
2013-01-03  0.643440  0.533915
2013-01-04 -0.292589 -1.421548
2013-01-05 -0.243784  0.134445
2013-01-06  1.625373 -0.636392

In [29]:
df.iloc[1, 1]

0.2530376128933468

In [30]:
df.iat[1, 1]

0.2530376128933468

In [31]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.240162  0.395355 -1.078836  0.700353
2013-01-03  1.366195  0.643440  0.533915  0.060252
2013-01-05  0.328955 -0.243784  0.134445 -0.564902
2013-01-06  1.329348  1.625373 -0.636392  0.846540

In [32]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.240162  0.395355       NaN  0.700353
2013-01-02       NaN  0.253038       NaN       NaN
2013-01-03  1.366195  0.643440  0.533915  0.060252
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05  0.328955       NaN  0.134445       NaN
2013-01-06  1.329348  1.625373       NaN  0.846540

In [33]:
df2 = df.copy()

In [34]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [35]:
df2

                   A         B         C         D      E
2013-01-01  0.240162  0.395355 -1.078836  0.700353    one
2013-01-02 -0.946592  0.253038 -0.904587 -0.314626    one
2013-01-03  1.366195  0.643440  0.533915  0.060252    two
2013-01-04 -0.694961 -0.292589 -1.421548 -1.546865  three
2013-01-05  0.328955 -0.243784  0.134445 -0.564902   four
2013-01-06  1.329348  1.625373 -0.636392  0.846540  three

In [36]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [37]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df["F"] = s1

In [39]:
df.at[dates[0], "A"] = 0

In [40]:
df.iat[0, 1] = 0

In [41]:
df.loc[:, "D"] = np.array([5] * len(df))

In [42]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.078836  5.0  NaN
2013-01-02 -0.946592  0.253038 -0.904587  5.0  1.0
2013-01-03  1.366195  0.643440  0.533915  5.0  2.0
2013-01-04 -0.694961 -0.292589 -1.421548  5.0  3.0
2013-01-05  0.328955 -0.243784  0.134445  5.0  4.0
2013-01-06  1.329348  1.625373 -0.636392  5.0  5.0

In [43]:
df2 = df.copy()

In [44]:
df2[df2 > 0] = -df2

In [45]:
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.078836 -5.0  NaN
2013-01-02 -0.946592 -0.253038 -0.904587 -5.0 -1.0
2013-01-03 -1.366195 -0.643440 -0.533915 -5.0 -2.0
2013-01-04 -0.694961 -0.292589 -1.421548 -5.0 -3.0
2013-01-05 -0.328955 -0.243784 -0.134445 -5.0 -4.0
2013-01-06 -1.329348 -1.625373 -0.636392 -5.0 -5.0

In [46]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [47]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [48]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.078836  5.0  NaN  1.0
2013-01-02 -0.946592  0.253038 -0.904587  5.0  1.0  1.0
2013-01-03  1.366195  0.643440  0.533915  5.0  2.0  NaN
2013-01-04 -0.694961 -0.292589 -1.421548  5.0  3.0  NaN

In [49]:
df1.dropna(how="any")

                   A         B         C    D    F    E
2013-01-02 -0.946592  0.253038 -0.904587  5.0  1.0  1.0

In [50]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.078836  5.0  5.0  1.0
2013-01-02 -0.946592  0.253038 -0.904587  5.0  1.0  1.0
2013-01-03  1.366195  0.643440  0.533915  5.0  2.0  5.0
2013-01-04 -0.694961 -0.292589 -1.421548  5.0  3.0  5.0

In [51]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [52]:
df.mean()

A    0.230491
B    0.330913
C   -0.562167
D    5.000000
F    3.000000
dtype: float64

In [53]:
df.mean(axis=1)

2013-01-01    0.980291
2013-01-02    0.880372
2013-01-03    1.908710
2013-01-04    1.118180
2013-01-05    1.843923
2013-01-06    2.463666
Freq: D, dtype: float64

In [54]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [55]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [56]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.366195 -0.356560 -0.466085  4.0  1.0
2013-01-04 -3.694961 -3.292589 -4.421548  2.0  0.0
2013-01-05 -4.671045 -5.243784 -4.865555  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [57]:
df.agg(lambda x: np.mean(x) * 5.6)

A     1.290749
B     1.853112
C    -3.148135
D    28.000000
F    16.800000
dtype: float64

In [58]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000 -109.178160  506.0    NaN
2013-01-02  -95.795098   25.607406  -91.544193  506.0  101.2
2013-01-03  138.258904   65.116115   54.032230  506.0  202.4
2013-01-04  -70.330044  -29.610044 -143.860617  506.0  303.6
2013-01-05   33.290288  -24.670974   13.605804  506.0  404.8
2013-01-06  134.529970  164.487798  -64.402871  506.0  506.0

In [59]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [60]:
s

0    2
1    6
2    0
3    0
4    5
5    4
6    2
7    5
8    4
9    6
dtype: int32

In [61]:
s.value_counts()

2    2
6    2
0    2
5    2
4    2
Name: count, dtype: int64

In [62]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [63]:
s

0    4
1    2
2    4
3    1
4    5
5    1
6    2
7    4
8    6
9    0
dtype: int32

In [64]:
s.value_counts()

4    3
2    2
1    2
5    1
6    1
0    1
Name: count, dtype: int64

In [65]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [66]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [67]:
df = pd.DataFrame(np.random.randn(10, 4))

In [68]:
df

          0         1         2         3
0 -0.851575  0.626386 -1.458846  0.631813
1 -0.162084 -3.249058 -0.762826 -1.475381
2 -1.085345 -2.238678  0.066293  1.490986
3 -1.222310  0.757359  0.380764 -1.350351
4  1.238418 -0.805690  0.136695 -0.267712
5 -1.592097 -0.152904  0.407127 -0.494579
6 -1.048593 -0.560039 -0.062167  0.698082
7 -0.189024 -0.485285 -0.066537  1.458338
8 -0.991041 -1.222776  0.540681  0.102196
9  0.000849  1.403425  0.371493  0.038025

In [69]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [70]:
pd.concat(pieces)

          0         1         2         3
0 -0.851575  0.626386 -1.458846  0.631813
1 -0.162084 -3.249058 -0.762826 -1.475381
2 -1.085345 -2.238678  0.066293  1.490986
3 -1.222310  0.757359  0.380764 -1.350351
4  1.238418 -0.805690  0.136695 -0.267712
5 -1.592097 -0.152904  0.407127 -0.494579
6 -1.048593 -0.560039 -0.062167  0.698082
7 -0.189024 -0.485285 -0.066537  1.458338
8 -0.991041 -1.222776  0.540681  0.102196
9  0.000849  1.403425  0.371493  0.038025

In [71]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [72]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [73]:
left

   key  lval
0  foo     1
1  foo     2

In [74]:
right

   key  rval
0  foo     4
1  foo     5

In [75]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [76]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})

In [77]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [78]:
left

   key  lval
0  foo     1
1  bar     2

In [79]:
right

   key  rval
0  foo     4
1  bar     5

In [80]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [81]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [82]:
df

     A      B         C         D
0  foo    one  1.461671 -0.434301
1  bar    one  1.528536  1.349465
2  foo    two -0.637666 -0.427064
3  bar  three  2.104012 -0.436056
4  foo    two  0.071813  0.715914
5  bar    two -2.119470  0.470445
6  foo    one  0.955476  1.204552
7  foo  three -1.485612  1.115940

In [83]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  1.513078  1.383855
foo  0.365681  2.175041

In [84]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    1.528536  1.349465
    three  2.104012 -0.436056
    two   -2.119470  0.470445
foo one    2.417146  0.770252
    three -1.485612  1.115940
    two   -0.565853  0.288849